import * as yup from "yup";

export const Schema2 = yup.object().shape({
  title: yup
    .string()
    .typeError("شما نمیتوانید عدد وارد کنید")
    .matches(/^[^0-9]*$/, "شما نمی‌توانید عدد وارد کنید")
    .min(3, ".عنوان کتاب باید بالای 3 کاراکتر باشد")
    .required(".شما باید عنوان کتاب را ووارد کنید"),
  author: yup
    .string()
    .typeError("شما نمیتوانید عدد وارد کنید")
    .matches(/^[^0-9]*$/, "شما نمی‌توانید عدد وارد کنید")
    .min(3, ".نام نویسنده باید بالای 3 کاراکتر باشد")
    .required(".شما باید نام نویسنده را وارد کنید"),
  year: yup
    .number()
    .integer(".شما باید اعداد صحیح وارد کنید")
    .typeError(".شما باید فقط عدد وارد کنید")
    .positive(".عدد منفی یا صفر نمیتواند باشد")
    .min(1900, ".سال انتشار کتاب نمیتواند کمتر از سال 1900 میلادی باشد")
    .max(2025, ".سال انتشار نمیتواند بیشتر از سال 2025 میلادی باشد")
    .required(".وارد کردن سال انتشار الزامی است"),
     image: yup
    .string()
});
